meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "КРИПОВЫЙ": "страшный, пугающий",
            "РОФЛ": "шутка",
            "ЩИЩ": "одобрение или восторг",
            "АГРИТЬСЯ": "злиться"
            }

while True:
    
    word = input("Введите непонятное слово (большими буквами!): ").upper()
    if word in meme_dict.keys():
        print(meme_dict[word])
    else:
        print("Слово не найдено")
    yeh = input("Вы хотите продожить")
    if yeh is "да":
        print("Окей")
    else:
        break
